// ----------------------------цикли--------------------------------------
// const target = 3;
// let sum = 0;

// for (let i = 0; i <= target; i += 1) {
//   sum += i;
// }

// console.log(sum);


// for (let i = 0; i <= 5; i += 1) {
//   console.log(i);

//   if (i === 3) {
//     console.log("Знайшли число 3, перериваємо виконання циклу");
//     break;
//   }
// }

// console.log("Лог після циклу");

// const number = 10;

// for (let i = 0; i < number; i += 1) {
//   if (i % 2 === 0) {
//     continue;
//   }

//   console.log("Непарне i: ", i); // 1, 3, 5, 7, 9
// }


// -----------------------------------------Задача1------------------------------------------
// Напиши скрипт вибору готелю по к - ті зірок
// 1, 2 - 20$, 3, 4 - 30$, 5 - 120$;
// Якщо в змінній starsщось окрім чисел 1 - 5, виведи стрічку "Такої кількості зірок немає".


const stars = 5;
let price;

// if (stars === 1) {
//     price = 20;
// } else if (stars === 2) {
//     price = 30;
// }
// else if (stars === 3) {
//     price = 50;
// }
// else if (stars === 4) {
//     price = 70;
// }
// else if(stars === 5) {
//     price = 120;
// } else {
//     console.log("Такої кількості зірок немає");
// }

// -------------------------з використанням switch ------------------------------------

// switch (stars) {
//     case 1:
//         price = 20;
//         break;
    
//     case 2:
//         price = 30;
//         break;
    
//     case 3:
//         price = 50;
//         break;
    
//     case 4:
//         price = 70;
//         break;
    
//     case 5:
//         price = 120;
//         break;
    
//     default:
//         console.log("Такої кількості зірок немає");
// }

// console.log(price);

// ------------------------------------------задача  2---------------------------------------
// Напиши скрипт опції доставки товару
// Опція зберігається у змінній option: 1 - самовивіз, 2 - курєр, 3 - пошта;
// В змінну message записати повідомлення в залежності від опції:
// - "Ви зможете забрати товар взавтра з 12.00 в нашому офісі"
// - "Курєр доставить замовлення завтра з 9.00 до 18.00"
// - посилка будее відправлена сьогодні
// - вам передзвонить менеджер

// 1. зробити змінні

// 2. зробити світч 1, 2, 3

// 3. В кожному кейсі записати в message стрічку

// 4. зробити log.message

// const option = 5;
// let message = '';


// switch (option) {
//     case 1:
//         message = "Ви зможете забрати товар взавтра з 12.00 в нашому офісі";
//         break;
//     case 2:
//         message = "Курєр доставить замовлення завтра з 9.00 до 18.00";
//         break;
//     case 3:
//         message = "посилка будее відправлена сьогодні";
//         break;
//     default:
//         message = "вам передзвонить менеджер";
// }

// console.log(message);

//
//-----------------------------------------цикл for------------------------------------------------

// for (ініціалізація; умова; пост - вираз) {
//     // тіло циклу
// }

// for (let i = 0; i < 10; i+=1){
//     console.log(i);
// }

// i += 1 те ж саме що й і = і + 1
// i -= 1 те ж саме що й і = і - 1


//----------------------------------------------Задача3-------------------------------------------
// НАПИШИ СКРИПТ, ЩО ПІДРАХОВУЄ СУМУ ЗАРПЛАТ ПРАЦІВНИКІВ
// к-ть працівників зберігається у змінній employees
// зарплата кожного працівника це випадкове число від 500 до 5000
// записати суму в змінну totalSalary і вивести в консоль

// 1 зробити змінні
// 2 перебрати працівників в циклі
// 3 згенерувати випадкову зп
// 4 додати до тоталу
// 5 вивести лог

// 1 зробити змінні
// const minSalary = 500;
// const maxSalary = 5000;
// const emloyees = 3;
// let totalSalary = 0;

// // 2 перебрати працівників в циклі
// for (let i = 1; i <= emloyees; i += 1) {
// // згенерувати випадкову зп
//     const salary = Math.round(Math.random()*(maxSalary-minSalary)+minSalary);
//     console.log(`ЗП працівника ${i} - ${salary}`);
    
//     // додати до тоталу
//     totalSalary += salary;
    
// }
// // 5 вивести лог
// console.log('totalSalary:', totalSalary);





// ---------------------------------------------Задача 4---------------------------------
// Напиши скрипт, що підраховує суму всіх парних чисел,
// які входять в діапазон чисел в змінних від minдо max
// Наприклад, якщо min=0 і max=5 то діапазон 0-5 і в ньому два парних числа - 2 і 4, їх сума 6

//1 оголосити змінні
// 2 цикл фор від мін до макс з кроком в 1


//1 оголосити змінні
// const min = 6;
// const max = 13;
// let total = 0;

// // 2 цикл фор від мін до макс з кроком в 1

// for (let i = min; i <= max; i += 1) {
//     console.log(i);

//     // перевіряєємо залишок від ділення
//     if (i % 2 === 0) {
//         console.log("парне", i);
//         total += i;

// }
// }
// // пишемо суму парних
// console.log("total:",total);

// --------------------------------------Задача5------------------------
// Напиши скрипт обробки покупки в магазині
// Баланс користувача зберігається у змінній balance
// Сума покупки зберігається у змінній payment
// Перед перевіркою вивести повідомлення: "Загальна вартість замовлення [число] кредитів. Перевіряємо к-ть доступних коштів на рахунку"
// вирахувати із балансу суму покупки
// вивести повідомлення "На рахунку залишилось [число] кредитів"
// Якщо сума покупки перевищує баланс:
// Вивести на екран: "На рахунку недостатньо коштів для проведення операції!"
// в кінці вивести повідомлення "Операція завершена"

// let balance = 10000;
// const payment = 2000;

// Все добре. Списуємо кошти. Дякуємо за покупку!
// 1. Змінні
// let balance = 10000;
// const payment = 2000;

// console.log(
//     `Загальна вартість замовлення ${payment} кредитів.
// Перевіряємо к-ть доступних коштів на рахунку`);
// // вирахувати із балансу суму покупки
// if (balance >= payment) {
//     console.log("Дозволено!!!");

//     balance -= payment;
//     // balance=balance-payment;
//     //виводимо повідомлення `Все добре. Знімаємо кошти. Дякуємо за покупку!!!
//     // вивести повідомлення "На рахунку залишилось [число] кредитів"
//     console.log(`Все добре. Знімаємо кошти. Дякуємо за покупку!!!`);
//     console.log(`На рахунку залишилось ${balance} кредитів`);
// }// Якщо сума покупки перевищує баланс:
// else {
//     // Вивести на екран: "На рахунку недостатньо коштів для проведення операції!"
//     console.log("На рахунку недостатньо коштів для проведення операції!");
// }
// // в кінці вивести повідомлення "Операція завершена"
// console.log("Операція завершена!");


// -------------------------------Задача6-----------------------------
// Напиши скрипт підрахунку суми покупки в залежності від потраченої
// за увесь час суми (партнерська програма)
// загальна сума витраченого зберігається в змінній totalSpent
// Сума поточної оплати зберігається в змінній payment
// скидка зберігається в змінній discount

// якщо витрачено від 100 до 1000 - бронзовий партнер. скидка 2%
// якщо витрачено від 1000 до 5000 - срібний партнер.скидка 5 %
// якщо витрачено від 5000  - ззолотий партнер.скидка 10 %
// якщо витрачено менше 100  - не партнер. скидка 0%
//В результаті вивести повідомлення 
// "Оформляємо замовлення на суму [сума] зі скидкою [скидка]"

// [] - включно
// () - невключно


// оголошення змінних

let totalSpent = 5000;
let payment = 500;
let discount = 0;

//якщо витрачено від 100 до 1000 - бронзовий партнер. скидка 2%
// if (totalSpent >= 100 && totalSpent < 1000) {
//     discount = 0.02;
//     console.log(`бронзовий партнер. скидка 2%`);
    
// }
// // якщо витрачено від 1000 до 5000 - срібний партнер.скидка 5 %
// else if (totalSpent >= 1000 && totalSpent < 5000) {
//     discount = 0.05;
//     console.log(`срібний партнер.скидка 5 %`);
// }
// // якщо витрачено від 5000  - ззолотий партнер.скидка 10 %
// else if (totalSpent >= 5000) {
//     discount = 0.1;
//     console.log(`золотий партнер.скидка 10 %`);
// }
// //  якщо витрачено менше 100  - не партнер. скидка 0%
// else {
//     console.log(`не партнер. скидка 0 %`);
// }

// payment -= payment * discount;
// //"Оформляємо замовлення на суму [сума] зі скидкою [скидка]"
// console.log(`Оформляємо замовлення на суму ${payment} зі скидкою ${discount * 100}%`);

// totalSpent += payment;

// console.log(`Загальна сума потраченого в магазині: ${totalSpent}`);